
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 11 to add, 1 to change, 8 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.stored[&#34;Ian-Test-all&#34;]
  * azurerm_key_vault_secret.stored[&#34;Ian-Test-normal-both&#34;]
  * azurerm_key_vault_secret.stored2[&#34;Ian-Test-all&#34;]
  * azurerm_key_vault_secret.stored2[&#34;Ian-Test-normal-both&#34;]
  * azurerm_key_vault_secret.stored64[&#34;Ian-Test-64-only&#34;]
  * azurerm_key_vault_secret.stored64[&#34;Ian-Test-all&#34;]
  * random_password.generated[&#34;Ian-Test-all&#34;]
  * random_password.generated[&#34;Ian-Test-normal-both&#34;]
* Update
  * azurerm_key_vault_secret.stored[&#34;Ian-Test-normal-only&#34;]
* Delete
  * azurerm_key_vault_secret.encoded[&#34;Ian-Test-64-only&#34;]
  * azurerm_key_vault_secret.encoded[&#34;Ian-Test-both&#34;]
  * azurerm_key_vault_secret.fixed_secrets[&#34;Ian-val&#34;]
  * azurerm_key_vault_secret.stored[&#34;Ian-Test-both&#34;]
  * random_password.generated[&#34;Ian-Test-both&#34;]
* Replace
  * random_password.generated[&#34;Ian-Test-64-only&#34;]
  * random_password.generated[&#34;Ian-Test-none&#34;]
  * random_password.generated[&#34;Ian-Test-normal-only&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.encoded["Ian-Test-64-only"] will be destroyed
  # (because azurerm_key_vault_secret.encoded is not in configuration)
  - resource "azurerm_key_vault_secret" "encoded" {
      - id                      = "https://juror-stg.vault.azure.net/secrets/Ian-Test-64-only-encoded/c604e15026244ed8b112f961d992a934" -> null
      - key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/juror-stg-rg/providers/Microsoft.KeyVault/vaults/juror-stg" -> null
      - name                    = "Ian-Test-64-only-encoded" -> null
      - resource_id             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/juror-stg-rg/providers/Microsoft.KeyVault/vaults/juror-stg/secrets/Ian-Test-64-only-encoded/versions/c604e15026244ed8b112f961d992a934" -> null
      - resource_versionless_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/juror-stg-rg/providers/Microsoft.KeyVault/vaults/juror-stg/secrets/Ian-Test-64-only-encoded" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "c604e15026244ed8b112f961d992a934" -> null
      - versionless_id          = "https://juror-stg.vault.azure.net/secrets/Ian-Test-64-only-encoded" -> null
    }

  # azurerm_key_vault_secret.encoded["Ian-Test-both"] will be destroyed
  # (because azurerm_key_vault_secret.encoded is not in configuration)
  - resource "azurerm_key_vault_secret" "encoded" {
      - id                      = "https://juror-stg.vault.azure.net/secrets/Ian-Test-both-encoded/9908f19cad534bd8b6f281fd3cee0e54" -> null
      - key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/juror-stg-rg/providers/Microsoft.KeyVault/vaults/juror-stg" -> null
      - name                    = "Ian-Test-both-encoded" -> null
      - resource_id             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/juror-stg-rg/providers/Microsoft.KeyVault/vaults/juror-stg/secrets/Ian-Test-both-encoded/versions/9908f19cad534bd8b6f281fd3cee0e54" -> null
      - resource_versionless_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/juror-stg-rg/providers/Microsoft.KeyVault/vaults/juror-stg/secrets/Ian-Test-both-encoded" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "9908f19cad534bd8b6f281fd3cee0e54" -> null
      - versionless_id          = "https://juror-stg.vault.azure.net/secrets/Ian-Test-both-encoded" -> null
    }

  # azurerm_key_vault_secret.fixed_secrets["Ian-val"] will be destroyed
  # (because key ["Ian-val"] is not in for_each map)
  - resource "azurerm_key_vault_secret" "fixed_secrets" {
      - id                      = "https://juror-stg.vault.azure.net/secrets/Ian-val/3a23da9f35bb4e56a8b57ca2d13beb92" -> null
      - key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/juror-stg-rg/providers/Microsoft.KeyVault/vaults/juror-stg" -> null
      - name                    = "Ian-val" -> null
      - resource_id             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/juror-stg-rg/providers/Microsoft.KeyVault/vaults/juror-stg/secrets/Ian-val/versions/3a23da9f35bb4e56a8b57ca2d13beb92" -> null
      - resource_versionless_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/juror-stg-rg/providers/Microsoft.KeyVault/vaults/juror-stg/secrets/Ian-val" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "3a23da9f35bb4e56a8b57ca2d13beb92" -> null
      - versionless_id          = "https://juror-stg.vault.azure.net/secrets/Ian-val" -> null
    }

  # azurerm_key_vault_secret.stored["Ian-Test-all"] will be created
  + resource "azurerm_key_vault_secret" "stored" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/juror-stg-rg/providers/Microsoft.KeyVault/vaults/juror-stg"
      + name                    = "Ian-Test-all"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.stored["Ian-Test-both"] will be destroyed
  # (because key ["Ian-Test-both"] is not in for_each map)
  - resource "azurerm_key_vault_secret" "stored" {
      - id                      = "https://juror-stg.vault.azure.net/secrets/Ian-Test-both/2365059686df49f28e244b643052442d" -> null
      - key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/juror-stg-rg/providers/Microsoft.KeyVault/vaults/juror-stg" -> null
      - name                    = "Ian-Test-both" -> null
      - resource_id             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/juror-stg-rg/providers/Microsoft.KeyVault/vaults/juror-stg/secrets/Ian-Test-both/versions/2365059686df49f28e244b643052442d" -> null
      - resource_versionless_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/juror-stg-rg/providers/Microsoft.KeyVault/vaults/juror-stg/secrets/Ian-Test-both" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "2365059686df49f28e244b643052442d" -> null
      - versionless_id          = "https://juror-stg.vault.azure.net/secrets/Ian-Test-both" -> null
    }

  # azurerm_key_vault_secret.stored["Ian-Test-normal-both"] will be created
  + resource "azurerm_key_vault_secret" "stored" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/juror-stg-rg/providers/Microsoft.KeyVault/vaults/juror-stg"
      + name                    = "Ian-Test-normal-both"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.stored["Ian-Test-normal-only"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "stored" {
        id                      = "https://juror-stg.vault.azure.net/secrets/Ian-Test-normal-only/02c6e84db1c94a4f82dde5aaf314130e"
        name                    = "Ian-Test-normal-only"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.stored2["Ian-Test-all"] will be created
  + resource "azurerm_key_vault_secret" "stored2" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/juror-stg-rg/providers/Microsoft.KeyVault/vaults/juror-stg"
      + name                    = "Ian-Test-all-Second"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.stored2["Ian-Test-normal-both"] will be created
  + resource "azurerm_key_vault_secret" "stored2" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/juror-stg-rg/providers/Microsoft.KeyVault/vaults/juror-stg"
      + name                    = "Ian-Test-normal-both-Second"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.stored64["Ian-Test-64-only"] will be created
  + resource "azurerm_key_vault_secret" "stored64" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/juror-stg-rg/providers/Microsoft.KeyVault/vaults/juror-stg"
      + name                    = "Ian-Test-64-only"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.stored64["Ian-Test-all"] will be created
  + resource "azurerm_key_vault_secret" "stored64" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/juror-stg-rg/providers/Microsoft.KeyVault/vaults/juror-stg"
      + name                    = "Ian-Test-all-64"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # random_password.generated["Ian-Test-64-only"] must be replaced
-/+ resource "random_password" "generated" {
      ~ bcrypt_hash = (sensitive value)
      ~ id          = "none" -> (known after apply)
      ~ min_lower   = 0 -> 3 # forces replacement
      ~ min_numeric = 0 -> 3 # forces replacement
      ~ min_upper   = 0 -> 3 # forces replacement
      ~ result      = (sensitive value)
        # (7 unchanged attributes hidden)
    }

  # random_password.generated["Ian-Test-all"] will be created
  + resource "random_password" "generated" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 32
      + lower       = true
      + min_lower   = 3
      + min_numeric = 3
      + min_special = 0
      + min_upper   = 3
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # random_password.generated["Ian-Test-both"] will be destroyed
  # (because key ["Ian-Test-both"] is not in for_each map)
  - resource "random_password" "generated" {
      - bcrypt_hash = (sensitive value) -> null
      - id          = "none" -> null
      - length      = 32 -> null
      - lower       = true -> null
      - min_lower   = 0 -> null
      - min_numeric = 0 -> null
      - min_special = 0 -> null
      - min_upper   = 0 -> null
      - number      = true -> null
      - numeric     = true -> null
      - result      = (sensitive value) -> null
      - special     = false -> null
      - upper       = true -> null
    }

  # random_password.generated["Ian-Test-none"] must be replaced
-/+ resource "random_password" "generated" {
      ~ bcrypt_hash = (sensitive value)
      ~ id          = "none" -> (known after apply)
      ~ min_lower   = 0 -> 3 # forces replacement
      ~ min_numeric = 0 -> 3 # forces replacement
      ~ min_upper   = 0 -> 3 # forces replacement
      ~ result      = (sensitive value)
        # (7 unchanged attributes hidden)
    }

  # random_password.generated["Ian-Test-normal-both"] will be created
  + resource "random_password" "generated" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 32
      + lower       = true
      + min_lower   = 3
      + min_numeric = 3
      + min_special = 0
      + min_upper   = 3
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # random_password.generated["Ian-Test-normal-only"] must be replaced
-/+ resource "random_password" "generated" {
      ~ bcrypt_hash = (sensitive value)
      ~ id          = "none" -> (known after apply)
      ~ min_lower   = 0 -> 3 # forces replacement
      ~ min_numeric = 0 -> 3 # forces replacement
      ~ min_upper   = 0 -> 3 # forces replacement
      ~ result      = (sensitive value)
        # (7 unchanged attributes hidden)
    }

Plan: 11 to add, 1 to change, 8 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":21,"Program":"tfcmt","SHA1":"","Vars":{}} -->